app/views/devise/registrations/new.html.erb

    <%= f.label :academic_type_id %><br />
    <%= f.collection_select :academic_type_id, AcademicType.all, :id, :abbreviation, prompt: true %>
---
SELECT `academic_types`.* FROM `academic_types` ORDER BY `academic_types`.`abbreviation` ASC