app/views/stream_subjects/_form.html.erb

SELECT `streams`.* FROM `streams`
---
    <%= form.label :stream_id %>
    <%= form.collection_select :stream_id, Stream.all, :id, :abbreviation, prompt: true %>

SELECT `subjects`.* FROM `subjects`
---
    <%= form.label :subject_id %>
    <%= form.collection_select :subject_id,Subject.all, :id, :abbreviation, prompt: true %>