app/views/streams/_form.html.erb

SELECT `academic_types`.* FROM `academic_types`
---
    <%= form.label :academic_type_id %>
  <%= collection_select(:stream, :academic_type_id, AcademicType.all, :id, :abbreviation, prompt: true) %>