app/controllers/academic_types_controller.rb

SELECT `academic_types`.* FROM `academic_types`
---
  def index
    @academic_types = AcademicType.all

INSERT INTO `academic_types` (`name`, `description`, `created_at`, `updated_at`, `abbreviation`) VALUES ('Bachelor\'s of  Technology', 'btech is  a common degree', '2017-07-22 11:38:33', '2017-07-22 11:38:33', 'BTECH')
---
  def create
    @academic_type = AcademicType.new(academic_type_params)

    respond_to do |format|
      if @academic_type.save

SELECT  `academic_types`.* FROM `academic_types` WHERE `academic_types`.`id` = 1 LIMIT 1
---
    def set_academic_type
      @academic_type = AcademicType.find(params[:id])