app/controllers/home_controller.rb

SELECT `subjects`.* FROM `subjects` WHERE (name LIKE '%%' OR abbreviation LIKE '%%' OR description LIKE '%%')
---
def search
  #@subjects = Subject.all
  #respond_to do |format|
  #if params[:search]
    #format.json { Subject.search(params[:search]).order("created_at DESC") }
 @subjects = Subject.search(params[:search]).to_json