app/controllers/stream_subjects_controller.rb

  def index
    @stream_subjects = StreamSubject.all
---
SELECT `stream_subjects`.* FROM `stream_subjects`

  def create
    @stream_subject = StreamSubject.new(stream_subject_params)

    respond_to do |format|
      if @stream_subject.save
---
INSERT INTO `stream_subjects` (`stream_id`, `subject_id`, `created_at`, `updated_at`, `year`) VALUES (8, 1, '2017-07-30 14:32:31', '2017-07-30 14:32:31', 1)

  def destroy
    @stream_subject.destroy
---
DELETE FROM `stream_subjects` WHERE `stream_subjects`.`id` = 1

    def set_stream_subject
      @stream_subject = StreamSubject.find(params[:id])
---
SELECT  `stream_subjects`.* FROM `stream_subjects` WHERE `stream_subjects`.`id` = 1 LIMIT 1
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1