app/controllers/streams_controller.rb

SELECT `streams`.* FROM `streams`
---
  def index
    @streams = Stream.all

INSERT INTO `streams` (`name`, `description`, `academic_type_id`, `created_at`, `updated_at`, `abbreviation`) VALUES ('Computer Science and Enginnering', 'computer branch', 1, '2017-07-22 11:49:34', '2017-07-22 11:49:34', 'CSE')
---
  def create
    @stream = Stream.new(stream_params)

    respond_to do |format|
      if @stream.save

DELETE FROM `streams` WHERE `streams`.`id` = 1
---
  def destroy
    @stream.destroy

SELECT  `streams`.* FROM `streams` WHERE `streams`.`id` = 1 LIMIT 1
---
    def set_stream
      @stream = Stream.find(params[:id])