app/controllers/subjects_controller.rb

SELECT `subjects`.* FROM `subjects`
---
  def index
    @subjects = Subject.all

INSERT INTO `subjects` (`name`, `description`, `stream_id`, `created_at`, `updated_at`, `abbreviation`) VALUES ('java programing', 'a object oriented language', 1, '2017-07-22 11:58:17', '2017-07-22 11:58:17', 'JAVA')
---
  def create
    #raise params.inspect
    @subject = Subject.new(subject_params)
    respond_to do |format|
      if @subject.save

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
    def set_subject
      @subject = Subject.find(params[:id])